src/mp_toir/Enums/СтатусыДефектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДефектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
					<Comment>Внесена запись о дефекте. Черновик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Признан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноУстранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Устранен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/СтатусыНарядаНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыНарядаНаРемонт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_НарядНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_НарядНаРемонт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыНарядаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.мп_ЗаданиеНаРемонт</v8:Type>
								<v8:Type>cfg:DocumentRef.РегистрацияДефекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнители</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДДокументаРабота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокументаРабота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнениеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Documents/РегистрацияДефекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияДефекта</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписаниеДефекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДефекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Критичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мечел_КритичностьДефекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаУстранение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дефекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мечел_ДефектыОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУстранения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Мечел_СпособыУстраненияДефектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДефектУстранен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстранения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияДефекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиФиксацииДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефекта</Name>
							<Comment>Для выгрузки в ЕРП</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефектаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияУстранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиУстраненияДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстраненияПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/CommonModules/НарядНаРемонтВызовСервераЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПроверкаСтатусаНарядаНаРемонт(ДокументИсточник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мп_НарядНаРемонтРаботы.Ссылка КАК НарядНаРемонт
	|ПОМЕСТИТЬ вт_НарядНаРемонт
	|ИЗ
	|	Документ.мп_НарядНаРемонт.Работы КАК мп_НарядНаРемонтРаботы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(&ДокументИсточник) = ТИП(Документ.мп_ЗаданиеНаРемонт)
	|				ТОГДА (ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.мп_ЗаданиеНаРемонт)) = &ДокументИсточник
	|			ИНАЧЕ (ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.РегистрацияДефекта)) = &ДокументИсточник
	|		КОНЕЦ
	|	И НЕ мп_НарядНаРемонтРаботы.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	мп_НарядНаРемонтРаботы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегистрацияДефекта.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт_РегистрацияДефекта
	|ИЗ
	|	вт_НарядНаРемонт КАК вт_НарядНаРемонт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РегистрацияДефекта КАК РегистрацияДефекта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_НарядНаРемонт.Работы КАК мп_НарядНаРемонтРаботы
	|			ПО ((ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.РегистрацияДефекта)) = РегистрацияДефекта.Ссылка)
	|		ПО (вт_НарядНаРемонт.НарядНаРемонт.Ссылка = мп_НарядНаРемонтРаботы.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_РегистрацияДефекта.Ссылка КАК РегистрацияДефекта,
	|	СУММА(1) КАК ВсегоСтрокДефекта,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрацияДефектаДефекты.ДефектУстранен = 1
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Устранены
	|ПОМЕСТИТЬ вт_РегистрацияУстранен
	|ИЗ
	|	Документ.РегистрацияДефекта.Дефекты КАК РегистрацияДефектаДефекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_РегистрацияДефекта КАК вт_РегистрацияДефекта
	|		ПО (вт_РегистрацияДефекта.Ссылка = РегистрацияДефектаДефекты.Ссылка)
	|ГДЕ
	|	вт_РегистрацияДефекта.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Устранен)
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_РегистрацияДефекта.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_НарядНаРемонт.НарядНаРемонт КАК НарядНаРемонт,
	|	мп_НарядНаРемонтРаботы.Работа КАК Работа,
	|	СУММА(1) КАК СтрокНаряда,
	|	СУММА(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(мп_НарядНаРемонтРаботы.Работа) = ТИП(Документ.РегистрацияДефекта)
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(вт_РегистрацияУстранен.Устранены = вт_РегистрацияУстранен.ВсегоСтрокДефекта, ЛОЖЬ)
	|							ТОГДА 1
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОГДА ТИПЗНАЧЕНИЯ(мп_НарядНаРемонтРаботы.Работа) = ТИП(Документ.мп_ЗаданиеНаРемонт)
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.мп_ЗаданиеНаРемонт).ВыполнениеОперации = """"""Да"""""", ЛОЖЬ)
	|							ТОГДА 1
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Исполнено
	|ИЗ
	|	вт_НарядНаРемонт КАК вт_НарядНаРемонт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_НарядНаРемонт.Работы КАК мп_НарядНаРемонтРаботы
	|			ЛЕВОЕ СОЕДИНЕНИЕ вт_РегистрацияУстранен КАК вт_РегистрацияУстранен
	|			ПО ((ВЫРАЗИТЬ(мп_НарядНаРемонтРаботы.Работа КАК Документ.РегистрацияДефекта)) = вт_РегистрацияУстранен.РегистрацияДефекта)
	|		ПО вт_НарядНаРемонт.НарядНаРемонт = мп_НарядНаРемонтРаботы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_НарядНаРемонт.НарядНаРемонт,
	|	мп_НарядНаРемонтРаботы.Работа
	|ИТОГИ ПО
	|	НарядНаРемонт";
	
	Запрос.УстановитьПараметр("ДокументИсточник", ДокументИсточник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНарядНаРемонт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНарядНаРемонт.Следующий() Цикл
		НарядНаРемонтОбъект = ВыборкаНарядНаРемонт.НарядНаРемонт.ПолучитьОбъект();
		Если ВыборкаНарядНаРемонт.СтрокНаряда = ВыборкаНарядНаРемонт.Исполнено Тогда
			НарядНаРемонтОбъект.Статус = Перечисления.СтатусыНарядаНаРемонт.Выполнен;
			НарядНаРемонтОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС;
		ИначеЕсли ВыборкаНарядНаРемонт.Исполнено > 0 Тогда
			НарядНаРемонтОбъект.Статус = Перечисления.СтатусыНарядаНаРемонт.ВРаботе;
			НарядНаРемонтОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкеВКИС;
		Иначе
			НарядНаРемонтОбъект.Статус = Перечисления.СтатусыНарядаНаРемонт.Создан;
			НарядНаРемонтОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан;
		КонецЕсли;
		НарядНаРемонтОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
